In [1]:
import pandas as pd
import numpy as np

### Let's create a dataframe

In [10]:
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  priyang     98    Male
1  Aadhiya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

1.Display Top Rows of The Dataset

In [15]:
df1.head()

      Name  Marks  Gender
0  priyang     98    Male
1  Aadhiya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male

In [16]:
df1.head(2)

      Name  Marks  Gender
0  priyang     98    Male
1  Aadhiya     89  Female

2.Check Last 3 Rows of The Dataset

In [17]:
df1.tail()

      Name  Marks  Gender
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [18]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

3.Find Shape of Our Dataset(Number of rows and Number of columns)

In [20]:
df1.shape

(7, 3)

In [21]:
print('number of rows',df1.shape[0])
print('number of columns',df1.shape[1])

number of rows 7
number of columns 3

4.Get Information About Our Dataset Like Total Number Rows,Total Number of Column,Datatypes of Each Column And Memory Requirement

In [22]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

5.Check Null Values in The Dataset

In [23]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [28]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [29]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

6.Get Overall Statics About The Dataframe

In [32]:
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [33]:
df1.describe(include='all')

          Name      Marks  Gender
count        7   7.000000       7
unique       7        NaN       2
top     Parshv        NaN  Female
freq         1        NaN       4
mean       NaN  92.142857     NaN
std        NaN   6.491753     NaN
min        NaN  83.000000     NaN
25%        NaN  88.000000     NaN
50%        NaN  90.000000     NaN
75%        NaN  98.500000     NaN
max        NaN  99.000000     NaN

7.Find Unique Values From The Gender Column

In [34]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

8.Find the number of Unique Values from the Gender Column

In [35]:
df1['Gender'].nunique()

2

9.Display Count of Unique Values in Gender Column

In [37]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

10.Find Total Number of Students Having Marks Between 90 to 100(inclusive) using between Method

In [10]:
df1['Marks']

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [40]:
df1['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [41]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [44]:
(df1['Marks']>=90) & (df1['Marks']<=100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [11]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [13]:
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [14]:
sum(df1['Marks'].between(90,100))

4

11.Find Average Marks

In [15]:
df1

      Name  Marks  Gender
0  priyang     98    Male
1  Aadhiya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [16]:
df1['Marks'].mean()

92.14285714285714

In [17]:
df1['Marks'].min()

83

In [19]:
df1['Marks'].max()

99

12. Apply Method

In [40]:
def marks(x):
    return x//2

In [41]:
df1['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [42]:
df1['Half_marks']=df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  Half_marks
0  priyang     98    Male          49
1  Aadhiya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

NB;We can use floor division instead of normal division to round up values

In [40]:
df1['Marks'].apply(lambda x:x//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [14]:
df1['Half_marks']=df1['Marks'].apply(lambda x:x//2)
df1

      Name  Marks  Gender  Male_Female  Male/Female  Half_marks
0  priyang     98    Male            1            1          49
1  Aadhiya     89  Female            0            0          44
2   Krisha     99  Female            0            0          49
3   Vedant     87    Male            1            1          43
4   Parshv     90    Male            1            1          45
5   Mittal     83  Female            0            0          41
6  Archana     99  Female            0            0          49

In the above cas,lambda took the place of functions.Another shortcut

In [41]:
df1['Name'].apply(len)

0    7
1    7
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [37]:
df1['Gender'].apply(len)

0    4
1    6
2    6
3    4
4    4
5    6
6    6
Name: Gender, dtype: int64

13.Map Function

In [16]:
df1

      Name  Marks  Gender  Male_Female  Male/Female  Half_marks
0  priyang     98    Male            1            1          49
1  Aadhiya     89  Female            0            0          44
2   Krisha     99  Female            0            0          49
3   Vedant     87    Male            1            1          43
4   Parshv     90    Male            1            1          45
5   Mittal     83  Female            0            0          41
6  Archana     99  Female            0            0          49

In [38]:
df1

      Name  Marks  Gender
0  priyang     98    Male
1  Aadhiya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [46]:
df1['Male/Female']=df1['Gender'].map({'Male':1,'Female':0})
df1

      Name  Marks  Gender  Half_marks  Male/Female
0  priyang     98    Male          49            1
1  Aadhiya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

14.Drop the columns

In [45]:
df1

      Name  Marks  Gender  Half_marks
0  priyang     98    Male          49
1  Aadhiya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [49]:
df1

      Name  Marks  Gender  Half_marks  Male/Female
0  priyang     98    Male          49            1
1  Aadhiya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [51]:
df1.drop(['Male/Female','Half_marks'],axis=1)

      Name  Marks  Gender
0  priyang     98    Male
1  Aadhiya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [48]:
df1

      Name  Marks  Gender  Half_marks  Male/Female
0  priyang     98    Male          49            1
1  Aadhiya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [52]:
df1.drop(['Half_marks','Male/Female'],axis=1)

      Name  Marks  Gender
0  priyang     98    Male
1  Aadhiya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

15.Print Name Of The Columns

In [54]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_marks', 'Male/Female'], dtype='object')

In [56]:
df1.index

RangeIndex(start=0, stop=7, step=1)

16.Sort The Dataframe As Per The Marks Column

In [57]:
df1

      Name  Marks  Gender  Half_marks  Male/Female
0  priyang     98    Male          49            1
1  Aadhiya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [61]:
df1.sort_values(by=['Marks','Gender'],ascending=True)

      Name  Marks  Gender  Half_marks  Male/Female
5   Mittal     83  Female          41            0
3   Vedant     87    Male          43            1
1  Aadhiya     89  Female          44            0
4   Parshv     90    Male          45            1
0  priyang     98    Male          49            1
2   Krisha     99  Female          49            0
6  Archana     99  Female          49            0

In [66]:
df1.drop(['Half_marks','Male/Female'],axis=1)
df1.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks  Gender  Half_marks  Male/Female
2   Krisha     99  Female          49            0
6  Archana     99  Female          49            0
0  priyang     98    Male          49            1
4   Parshv     90    Male          45            1
1  Aadhiya     89  Female          44            0
3   Vedant     87    Male          43            1
5   Mittal     83  Female          41            0

17.Display Name and Marks of the Female Students

In [67]:
df1

      Name  Marks  Gender  Half_marks  Male/Female
0  priyang     98    Male          49            1
1  Aadhiya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [71]:
df1[df1['Gender']=='Male'][['Name','Marks']]

      Name  Marks
0  priyang     98
3   Vedant     87
4   Parshv     90

In [72]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1  Aadhiya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [77]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1  Aadhiya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [76]:
df1[df1["Gender"].isin(["Male"])][['Name','Marks']]

      Name  Marks
0  priyang     98
3   Vedant     87
4   Parshv     90

Lines 77 and 76 are the shortcuts for displaying names and marks for students